org-mode/Org-mode任务依赖的高级应用.org
#+TITLE: Org-mode任务依赖的高级应用
#+URL: http://karl-voit.at/2016/12/18/org-depend/
#+AUTHOR: lujun9972
#+TAGS: org-mode
#+DATE: [2018年 03月 02日 星期五 14:19:05 CST]
#+LANGUAGE:  zh-CN
#+OPTIONS:  H:6 num:nil toc:t \n:nil ::t |:t ^:nil -:nil f:t *:t <:nil
2018-02-02更新:[[https://elpa.gnu.org/packages/org-edna.html][org-edna]] 的链接

本博客的目标受众是 [[../../../../tags/emacs][Emacs]] [[http://orgmode.org][org-mode]] 高级用户以及那些对如何使用这些工具完成非琐碎的待办事务管理感到好奇的人。

我们通过第三方贡献的 package =org-depend.el= 来定义待办任务之间的依赖关系. 该package有一组很好的特性. 不过我的工作流只用到了其中的部分功能。
因此，本文并对 =org-depend= 进行详细说明。但是给出使用和改进它的一些想法。

** 使用yasnippet 和 yankpad 进行高级代码片段管理
:PROPERTIES:
:CUSTOM_ID: advanced-snippets-with-yasnippet-and-yankpad
:CLASS: section-title
:END:

对于一次性工作流，我手动创建任务并定义依赖项。然而，当我不得不多次做某事时，我倾向于使用[[.. .. .. .. .. ..][snippet software]]通过快捷键的方式插入标题和任务。我写了一个[[.. .. .. .. ..][关于文本片段工具的德语博客]]。

比如我使用 =ccn= =TAB= 来插入静态的信用卡号. 通过 =dd= =TAB= 静态地插入ISO格式的当前日期,比如 =2016-12-17=. 下面我还会描述一个复杂的工作流，需要用到一个代码片段工具，以此提供复杂的、交互式的代码片段。

[[https://github.com/joaotavora/yasnippet][yasnippet]] 支持从简单到高级的Emacs片段管理了应用. 有了 yasnippet, 你可以根据major-mode(比如org-mode)管理目录中不同文件中的代码片段。
扩展代码片段是通过键入代码片段定义的缩写(例如 =dd= )，然后接着(通常是)按 =TAB= 键来完成的。

多年来我一直使用 yasnippet,知道我发现了 [[https://github.com/Kungsgeten/yankpad][yankpad]],它是对 yasnippet 的一个封装。与yasnippet相比，yankpad通过Org-mode文件中的不同标题（而不是目录下的不同文件）来管理代码片段
由于我的代码片段多是用于Org-mode中的，所以我很高兴地接受了yankpad，并将所有的org-mode代码片段都迁移到了它上面。这使得维护更加容易，因为我在编写代码片段时能应用完整的org-mode功能。

有了这样一个强力的snippet系统，我只需要定义一次复杂的工作流，而无需在创建工作流实例时处理依赖定义。
因此，对于我日常使用的工作流来说，将复杂性放到代码片段模板中，可以立即让我从中受益。

** 应用示例: 与朋友组织一个歌舞晚会
:PROPERTIES:
:CUSTOM_ID: example-use-case-organizing-an-cabaret-evening-with-friends
:CLASS: section-title
:END:

我喜欢和朋友一起去看歌舞表演。为了在不忘记重要事情的情况下尽量减少组织工作，我维护了一个简单的工作流程:

1. 活动基本信息:艺术家，日期，简短描述，…
2. 定票
3. 给我的朋友发封邮件，问问谁会参加
4. 记下每一个参加的人
5. 在活动开始前不久发一封提醒邮件，这样没人会忘记
6. 为活动之夜本身创建一个org-mode事件

