blog/2018/03/02/org-mode任务依赖的高级应用/index.html
<!DOCTYPE html>
<html lang="en">
<head>
  <title>Org-mode任务依赖的高级应用 - EMACS-DOCUMENT</title>
  <meta charset="utf-8" />
  <meta http-equiv="X-UA-Compatible" content="IE=edge"/>
  <meta name="viewport"
        content="width=device-width, initial-scale=1, maximum-scale=1, user-scalable=no"/>
  <meta name="author" content="lujun9972" />
  <meta name="keywords" content="org-mode" />
  <!-- <link rel="stylesheet" href="../../../../../media/css/main.css" type="text/css"/>
       <link rel="stylesheet" href="../../../../../media/css/comment.css" type="text/css"/> -->
  <link rel='stylesheet' href='https://cdn.jsdelivr.net/gh/kognise/water.css@latest/dist/dark.css'>
  <link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/gitalk@1/dist/gitalk.css">
</head>

  <body><div class="container">
<div>
  <header class="masthead">
    <h1 class="masthead-title"><a href="../../../../../">EMACS-DOCUMENT</a></h1>
    <p>=============&gt;随便,谢谢</p>
    <nav class="site-nav">
      <ul class="trigger">
        <li><a href="../../../../../years/">Years</a></li>
        <li><a href="../../../../../authors/">Authors</a></li>
        <li><a href="../../../../../tags/">Tags</a></li>
        <li><a href="../../../../../about/">About</a></li>
        <li><a href="https://github.com/lujun9972/emacs-document.git">Github</a></li>
        <li><a href="../../../../../rss.xml">RSS</a></li>
      </ul>
    </nav>
    <form method="get" id="searchform" action="https://www.bing.com/search">
      <input type="text" class="field" name="q" id="s" placeholder="Search">
      <input type="hidden" name="as_sitesearch" value="lujun9972.github.io/emacs-document">
    </form>
  </header>
</div>

<div>
<div class="post">
<h1 class="title">Org-mode任务依赖的高级应用</h1>
<div id="table-of-contents">
<h2>&#30446;&#24405;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#advanced-snippets-with-yasnippet-and-yankpad">使用yasnippet 和 yankpad 进行高级代码片段管理</a></li>
<li><a href="#example-use-case-organizing-an-cabaret-evening-with-friends">应用示例: 与朋友组织一个歌舞晚会</a></li>
<li><a href="#using-an-advanced-interactive-snippet">使用高级的交互式代码片段</a></li>
<li><a href="#advanced-workflows">高级工作流</a></li>
<li><a href="#room-for-improvements">改进空间</a>
<ul>
<li><a href="#improvement-id-picker">改进:ID选择器</a></li>
<li><a href="#improvement-generating-ids-from-heading-and-date">改进:根据标题和日期生成id</a></li>
<li><a href="#improvement-assistant-for-creating-workflow-elements">改进:创建工作流元素的助手</a></li>
<li><a href="#improvement-trigger-in-combination-with-set-scheduled">改进: TRIGGER 与 SCHEDULED 设置整合</a></li>
<li><a href="#improvement-canceled-tasks-do-cancel-their-dependencies-as-well">改进:取消任务的同时也会取消它们的依赖关系</a></li>
</ul>
</li>
<li><a href="#conclusion">结论</a></li>
<li><a href="#org-edna">org-edna</a></li>
</ul>
</div>
</div>
<p>
2018-02-02更新:<a href="https://elpa.gnu.org/packages/org-edna.html">org-edna</a> 的链接
</p>

<p>
本博客的目标受众是 <a href="https://karl-voit.at/tags/emacs">Emacs</a> <a href="http://orgmode.org">org-mode</a> 高级用户以及那些对如何使用这些工具完成非琐碎的待办事务管理感到好奇的人。
</p>

<p>
我们通过第三方贡献的 package <code>org-depend.el</code> 来定义待办任务之间的依赖关系. 该package有一组很好的特性. 不过我的工作流只用到了其中的部分功能。
因此，本文并对 <code>org-depend</code> 进行详细说明。但是给出使用和改进它的一些想法。
</p>

<div id="outline-container-org9f14a44" class="outline-2">
<h2 id="advanced-snippets-with-yasnippet-and-yankpad"><a id="org9f14a44"></a>使用yasnippet 和 yankpad 进行高级代码片段管理</h2>
<div class="outline-text-2" id="text-advanced-snippets-with-yasnippet-and-yankpad">
<p>
对于一次性工作流，我手动创建任务并定义依赖项。然而，当我不得不多次做某事时，我倾向于使用<a href="https://karl-voit.at/apps-I-am-using">snippet software</a>通过快捷键的方式插入标题和任务。我写了一个<a href="https://karl-voit.at/Textbausteine">关于文本片段工具的德语博客</a>。
</p>

<p>
比如我使用 <code>ccn</code> <code>TAB</code> 来插入静态的信用卡号. 通过 <code>dd</code> <code>TAB</code> 静态地插入ISO格式的当前日期,比如 <code>2016-12-17</code>. 下面我还会描述一个复杂的工作流，需要用到一个代码片段工具，以此提供复杂的、交互式的代码片段。
</p>

<p>
<a href="https://github.com/joaotavora/yasnippet">yasnippet</a> 支持从简单到高级的Emacs片段管理了应用. 有了 yasnippet, 你可以根据major-mode(比如org-mode)管理目录中不同文件中的代码片段。
扩展代码片段是通过键入代码片段定义的缩写(例如 <code>dd</code> )，然后接着(通常是)按 <code>TAB</code> 键来完成的。
</p>

<p>
多年来我一直使用 yasnippet,知道我发现了 <a href="https://github.com/Kungsgeten/yankpad">yankpad</a>,它是对 yasnippet 的一个封装。与yasnippet相比，yankpad通过Org-mode文件中的不同标题（而不是目录下的不同文件）来管理代码片段
由于我的代码片段多是用于Org-mode中的，所以我很高兴地接受了yankpad，并将所有的org-mode代码片段都迁移到了它上面。这使得维护更加容易，因为我在编写代码片段时能应用完整的org-mode功能。
</p>

<p>
有了这样一个强力的snippet系统，我只需要定义一次复杂的工作流，而无需在创建工作流实例时处理依赖定义。
因此，对于我日常使用的工作流来说，将复杂性放到代码片段模板中，可以立即让我从中受益。
</p>
</div>
</div>

<div id="outline-container-org55cda5c" class="outline-2">
<h2 id="example-use-case-organizing-an-cabaret-evening-with-friends"><a id="org55cda5c"></a>应用示例: 与朋友组织一个歌舞晚会</h2>
<div class="outline-text-2" id="text-example-use-case-organizing-an-cabaret-evening-with-friends">
<p>
我喜欢和朋友一起去看歌舞表演。为了在不忘记重要事情的情况下尽量减少组织工作，我维护了一个简单的工作流程:
</p>

<ol class="org-ol">
<li>活动基本信息:艺术家，日期，简短描述，…</li>
<li>定票</li>
<li>给我的朋友发封邮件，问问谁会参加</li>
<li>记下每一个参加的人</li>
<li>在活动开始前不久发一封提醒邮件，这样没人会忘记</li>
<li>为活动之夜本身创建一个org-mode事件</li>
</ol>
</div>
</div>
