blog/2018/03/02/org-mode任务依赖的高级应用/index.html

<div id="outline-container-org7fcabda" class="outline-2">
<h2 id="using-an-advanced-interactive-snippet"><a id="org7fcabda"></a>使用高级的交互式代码片段</h2>
<div class="outline-text-2" id="text-using-an-advanced-interactive-snippet">
<p>
假设，我在报纸上无意中看到，我最喜欢的一位艺术家要来。
</p>

<p>
我切换到用来存储这类事件的org-mode文件。我通过快捷键插入一个yankpad代码片段，然后选择有关歌舞剧的代码片段。
Emacs会询问我活动的日期(使用日期选择器)、艺术家的名字、歌舞表演项目的名称、地点(从预先定义的场地列表中选择)、我将预订多少座位、第一封和第二封电子邮件的日期。
</p>

<p>
我的yankpad代码片段如下所示。我还定义了一些简单的封装函数来询问和插入内容 <code>my-capture-prompt</code>, <code>my-capture-selection</code>, 以及 <code>my-capture-insert</code> ，这些函数可以在<a href="https://github.com/novoid/dot-emacs/blob/master/main.el">我的Emacs配置</a>中找到。
</p>

<pre class="example">
\** Cabaret `(my-capture-prompt "date of event" 'my-event-date)`: `(my-capture-prompt "artist" 'my-artist)`
:PROPERTIES:
:ID: `(my-capture-insert 'my-event-date)`-cabaret
:END:

- Title: `(my-capture-prompt "title" 'my-title)`
- `(my-capture-prompt "Num of seats" 'my-num-seats)` seats reserved:
  - 2: My girlfriend and I
  - 2:
  - 2:
  - 2:

\*** WAITING Make reservation for `(my-capture-insert 'my-num-seats)` seats
:PROPERTIES:
:ID: `(my-capture-insert 'my-event-date)`-reservation
:TRIGGER: `(my-capture-insert 'my-event-date)`-offer-seats(TODO) `(my-capture-insert 'my-event-date)`-reminder-email(TODO)
:END:

\*** Email: offer `(my-capture-insert 'my-num-seats)`-2 seats
SCHEDULED: &lt;`(my-capture-prompt "date 1st email" 'my-email-date)`&gt;
:PROPERTIES:
:ID: `(my-capture-insert 'my-event-date)`-offer-seats
:END:

Email template:
#+BEGIN_QUOTE
Cabaret: `(my-capture-insert 'my-artist)` on `(my-capture-insert 'my-event-date)`

Hi friends!

Who:    `(my-capture-insert 'my-artist)`
What:   "`(my-capture-insert 'my-title)`"
When:   `(my-capture-insert 'my-event-date)` 19:15
Where:  `(my-capture-selection '("Theatercafé" "Orpheum") 'my-location)`

First come, first served. We've got `(my-capture-insert 'my-num-seats)` seats.

Karl
#+END_QUOTE

\*** Send reminder email
SCHEDULED: &lt;`(my-capture-prompt "date reminder" 'my-reminder-date)`&gt;
:PROPERTIES:
:BLOCKER: `(my-capture-insert 'my-event-date)`-offer-seats
:ID: `(my-capture-insert 'my-event-date)`-reminder-email
:END:

\*** `(my-capture-insert 'my-artist)`: "`(my-capture-insert 'my-title)`" (`(my-capture-insert 'my-location)`)
:PROPERTIES:
:ID: `(my-capture-insert 'my-event-date)`-cabaret-event
:END:

&lt;`(my-capture-insert 'my-event-date)` 20:00-23:30&gt;
</pre>

<p>
你可以看到，通过使用 <code>my-capture-promt</code> 和 <code>my-capture-insert</code> 函数，我们可以很容易重用事件日期等信息。
</p>

<p>
应用该代码段并创建一个实例将得到如下结果:
</p>

<div class="org-src-container">
<pre class="src src-org"><span style="font-weight: bold; font-style: italic;">** Cabaret 2017-01-24: Thomas Maurer</span>
<span style="font-weight: bold;">:PROPERTIES:</span>
<span style="font-weight: bold;">:ID:</span> 2017-01-24-cabaret
<span style="font-weight: bold;">:END:</span>

- Title: Der Tolerator
- 8 seats reserved:
  - 2: My girlfriend and I
  - 2:
  - 2:
  - 2:

<span style="font-weight: bold;">*** WAITING Make reservation for 8 seats</span>
<span style="font-weight: bold;">:PROPERTIES:</span>
<span style="font-weight: bold;">:ID:</span> 2017-01-24-reservation
<span style="font-weight: bold;">:TRIGGER:</span> 2017-01-24-offer-seats(TODO) 2017-01-24-reminder-email(TODO)
<span style="font-weight: bold;">:END:</span>

<span style="font-weight: bold;">*** Email: offer 8-2 seats</span>
<span style="font-weight: bold;">SCHEDULED:</span> <span style="text-decoration: underline;">&lt;2017-01-05&gt;</span>
<span style="font-weight: bold;">:PROPERTIES:</span>
<span style="font-weight: bold;">:ID:</span> 2017-01-24-offer-seats
<span style="font-weight: bold;">:END:</span>

Email template:
<span style="font-weight: bold; font-style: italic;">#+BEGIN_QUOTE</span>
Cabaret: Thomas Maurer on 2017-01-24

Hi friends!

Who:    Thomas Maurer
What:   "Der Tolerator"
When:   2017-01-24 19:15
Where:  Theatercaf&#233;

First come, first served. We've got 8 seats.

Karl
<span style="font-weight: bold; font-style: italic;">#+END_QUOTE</span>

<span style="font-weight: bold;">*** Send reminder email</span>
<span style="font-weight: bold;">SCHEDULED:</span> <span style="text-decoration: underline;">&lt;2017-01-21&gt;</span>
<span style="font-weight: bold;">:PROPERTIES:</span>
<span style="font-weight: bold;">:BLOCKER:</span> 2017-01-24-offer-seats
<span style="font-weight: bold;">:ID:</span> 2017-01-24-reminder-email
<span style="font-weight: bold;">:END:</span>

<span style="font-weight: bold;">*** Thomas Maurer: "Der Tolerator" (Theatercaf&#233;)</span>
<span style="font-weight: bold;">:PROPERTIES:</span>
<span style="font-weight: bold;">:ID:</span> 2017-01-24-cabaret-event
<span style="font-weight: bold;">:END:</span>

<span style="text-decoration: underline;">&lt;2017-01-24 20:00-23:30&gt;</span>
</pre>
</div>

<p>
注意，对于不同日期的多个歌舞剧事件，其id是惟一的，因为事件日期是id的一部分，并且所有依赖项都是预先定义好的。
</p>

<p>
一旦订好票了并将其任务标记为done后，两个发送邮件的任务将通过 <code>:TRIGGER:</code> 变成“TODO”状态。
</p>

<p>
更新于2017-11-23:状态关键字的传播<a href="http://lists.gnu.org/archive/html/emacs-orgmode/2017-11/msg00260.html">在某些情况下不能工作</a>。
</p>

<p>
为了演示先决条件被阻塞的情况，我为提醒电子邮件任务添加了 <code>:BLOCKER:</code> 依赖，在这个特定的示例中，它有点多余. 
标记了 <code>:BLOCKER:</code> 的标题与普通标题有一个细微的区别:只要阻塞ID没有标记为完成(或取消), <code>:BLOCKER:</code> 任务就不会出现在我的日程中。
这个特性非常棒，因为只要不满足先决条件，我就看不到已定义和计划好的任务。因此，我总是在工作流程中定义 <code>:TRIGGER:</code> 和 <code>:BLOCKER:</code> 依赖项，以使我的日程不会被现在无法处理的代办任务搞得一团糟。
</p>

<p>
定义一个复杂的代码片段需要时间和精力。不过只要您为工作流定义好了复杂的代码片段，就可以轻松地多次设置工作流实例，这是它的优势。
</p>
</div>
</div>

<div id="outline-container-org70bfc57" class="outline-2">
<h2 id="advanced-workflows"><a id="org70bfc57"></a>高级工作流</h2>
<div class="outline-text-2" id="text-advanced-workflows">
<p>
歌舞剧的例子比较简单，只是为了演示基本的思想。我使用的项目模板,eBay购物工作流，<a href="https://en.wikipedia.org/wiki/Scrum_%28software_development%29">Scrum</a>故事管理，甚至是整个学期的整个课程管理，包括考试准备和学生评分则要复杂的多，这些都是由几十个标题组成的。
</p>

<p>
 <code>chain-find-next(KEYWORD[,OPTIONS])</code> helps you finding the "next" heading.
除了在代码片段中使用的 <code>:TRIGGER:</code> 和 <code>:BLOCKER:</code> 依赖之外, <code>org-depend.el</code> 还提供了其他功能。
通过 <code>chain-sibling(KEYWORD)</code>, 可以让当前标题被标记为完成时，下一个标题变成 <code>KEYWORD</code> 状态。
还有 <code>chain-siblings-scheduled</code>, 它将在 SCHEDULED 日期切换下一个标题的状态。 下一个标题由 <code>chain-find-next(KEYWORD[，OPTIONS])</code> 来决定。
</p>

<p>
虽然这些是很好的特性，但我不使用它们，因为我需要更精细的特性，下面将会讲到。
</p>
</div>
</div>

<div id="outline-container-orgeb2dc44" class="outline-2">
<h2 id="room-for-improvements"><a id="orgeb2dc44"></a>改进空间</h2>
<div class="outline-text-2" id="text-room-for-improvements">
<p>
I wrote down some possible improvements that would ease my personal digital life.
由于我是 <code>org-depend.el</code> 的高级用户,再加上 <a href="https://lists.gnu.org/archive/html/emacs-orgmode/2016-12/msg00236.html">Carsten 在训一些改进 =org-depend.el=的意见</a>,我写下了一些可能会改善我个人数字生活的改进意见。
</p>

<p>
其中一些问题可能只需要几行Elisp代码就可以解决了。不幸的是，我自己Elisp的编码能力很差，因此无法随心随意地扩展Emacs。
</p>
</div>

<div id="outline-container-org7e718de" class="outline-3">
<h3 id="improvement-id-picker"><a id="org7e718de"></a>改进:ID选择器</h3>
<div class="outline-text-3" id="text-improvement-id-picker">
<p>
首先，我希望在定义 <code>:TRIGGER:</code> 和 <code>:BLOCKER:</code> 依赖时能使用ID选择器。
</p>

<p>
This should work like this: after setting up the task in headings and giving them IDs, I'd like to invoke a "I want to define a dependency"-command. It first asks me what property I want to set: <code>:TRIGGER:</code> or <code>:BLOCKER:</code>.
它的工作方式应该是这样的:在标题中设置好任务并为其id之后，调用一个“我想定义一个依赖项”的命令,它首先会询问我要设置什么属性: <code>:TRIGGER:</code> 还是 <code>:BLOCKER:</code> 。
</p>

<p>
然后选择在相同的子层次结构中找到的所有ID(或者更进一步，所有文件中找到的ID?)
</p>

<p>
然后为 <code>:TRIGGER:</code> 依赖(如果适用)设置好 KEYWORD 后，相应的属性将添加到当前标题上。
</p>

<p>
这将极大地改进创建依赖项定义的过程，并在第一时间防止输入错误。
</p>
</div>
</div>
